app/controllers/icons_controller.rb

SELECT "icons".* FROM "icons"
---
  def index
    @icons = Icon.all

INSERT INTO "icons" ("name_icon", "image_icon", "image_binary", "image_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @icon = Icon.new
    @icon.name_icon = params[:icon][:name_icon]
    if params[:icon][:image_icon].present?
      @icon.image_icon = params[:icon][:image_icon].original_filename
      @icon.image_type = params[:icon][:image_icon].content_type
      @icon.image_binary = params[:icon][:image_icon].read
    end
    if @icon.save

SELECT  "icons".* FROM "icons" WHERE "icons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "icons" SET "image_icon" = ?, "image_type" = ?, "image_binary" = ?, "updated_at" = ? WHERE "icons"."id" = ?  [["image_icon", "お休みクルーク.jpg"], ["image_type", "image/jpeg"], ["image_binary", "<74870 bytes of binary data>"], ["updated_at", "2017-10-18 01:16:50.208290"], ["id", 1]]
---
  def update
    @icon = Icon.find(params[:id])
    @icon.name_icon = params[:icon][:name_icon]
    if params[:icon][:image_icon].present?
      @icon.image_icon = params[:icon][:image_icon].original_filename
      @icon.image_type = params[:icon][:image_icon].content_type
      @icon.image_binary = params[:icon][:image_icon].read
    end
    if @icon.save

SELECT  "icons".* FROM "icons" WHERE "icons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
def show_image
  @icon = Icon.find(params[:id])

DELETE FROM "icons" WHERE "icons"."id" = ?  [["id", 15]]
---
  def destroy
    @icon.destroy

SELECT  "icons".* FROM "icons" WHERE "icons"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
---
    def set_icon
      @icon = Icon.find(params[:id])