app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name_user", "mail_user", "pass_user", "icon_user", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name_user", "おっぱい"], ["mail_user", "ぱいおつ"], ["pass_user", "OPPAI"], ["icon_user", ""], ["created_at", "2017-10-30 01:40:47.887930"], ["updated_at", "2017-10-30 01:40:47.887930"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "mail_user" = ?, "pass_user" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["mail_user", "aaaaaaaa"], ["pass_user", "aaaaaaaaaaaaaa"], ["updated_at", "2017-11-01 01:04:08.240212"], ["id", 1]]